Добро пожаловать в IPython Notebook
--------------------------

Данный notebook печатает классическое `"Hello world!`.

Для запуска блока команд, нажмите на него, и используйте SHIFT+ENTER

Также есть дополнительные keyboard hotkeys (описанные в меню Help)

In [2]:
print ("Hello world!")

Hello world!

Проверим, что у вас подключена возможность работы с SQL

In [3]:
%load_ext sql
%sql sqlite:///tst_1.db

'Connected: @tst_1.db'

Однострочный SQL-запрос

In [4]:
%sql select 1

 * sqlite:///tst_1.db
Done.

[(1,)]

Многострочный SQL-запрос

In [5]:
%%sql
Select 1
union
select 2

 * sqlite:///tst_1.db
Done.

[(1,), (2,)]

Создадим таблицу Факультетов со следующими полями:
1. fac_id - уникальный идентификатор факультета
2. Name - Имя факультета

In [7]:
%%sql 
drop table if exists Faculties;

CREATE TABLE Faculties 
(
    id integer primary key, 
    Name varchar(50)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

Проверим, что таблица создана

In [8]:
%sql select * from Faculties

 * sqlite:///tst_1.db
Done.

[]

Заполним таблицу данными

In [11]:
%%sql
insert Into Faculties(id, name) values (1, 'KIB');
insert Into Faculties(id, name) values (2, 'IT');
insert Into Faculties(id, name) values (3, 'Economics');

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

SQLite требует включение поддержки внешних ключей.
Более подробно можно посмотреть [здесь](https://sqlite.org/foreignkeys.html)

In [15]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite:///tst_1.db
Done.

[]

Создадим таблицу Студентов со следующими полями:
1. Student_id - уникальный идентификатор студента
2. Name - имя студента
3. Second Name - фамилия студенты
4. Faculty - факультет студента
5. StudyGroup - группа студента 
6. GPA - средний балл

In [16]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50), 
    Faculty_id integer ,
    StudyGroup varchar(20),
    GPA number,
    foreign key(faculty_id) references  Faculties(id)
);

 * sqlite:///tst_1.db
Done.
Done.

[]

Проверим, что таблица создана

In [17]:
%sql select * from Students

 * sqlite:///tst_1.db
Done.

[]

Заполним таблице данными

In [18]:
%%sql
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (1, 'Anton', 'Sidorov', 1, '101', 3.5);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (2, 'Alexey', 'Petrov', 2, '201', 3.3);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (3, 'Ivan', 'Meshkov', 1, '101', 4.5);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (4, 'Elena', 'Kvitova', 3, '301', 4.8);
insert into Students(student_id, Name, SecondName, Faculty_id, StudyGroup, GPA) VALUES (5, 'Darya', 'Salnikova', 2, '202', 3.4);

 * sqlite:///tst_1.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Проверим наличие данных

In [19]:
%sql select * from Students

 * sqlite:///tst_1.db
Done.

[(1, 'Anton', 'Sidorov', 1, '101', 3.5),
 (2, 'Alexey', 'Petrov', 2, '201', 3.3),
 (3, 'Ivan', 'Meshkov', 1, '101', 4.5),
 (4, 'Elena', 'Kvitova', 3, '301', 4.8),
 (5, 'Darya', 'Salnikova', 2, '202', 3.4)]

## Задание 1. Напишите SQL-запрос, возвращающий ваше имя

## Задание 2. Напишите SQL-запрос, возвращающий имена всех студентов с фамилией Sidorov

## Задание 3. Выведите все названия факультетов, на которых учится хотя бы один студент со средним баллом не менее 4. Имя факультета должно встречаться один раз в выводе

## Задание 4. Вывести только тех студентов, фамилия которых начинается с 'S', а в имени присутствует 'a'.

## Задание 5. Вывести только те факультеты, количество групп в которых больше 3

## Задание 6. Для всех факультетов вывести средний балл по факультету для студентов, чья фамилия не содержит в себе подстроку 'ov', при условии, что количество таких студентов на факультете не менее 3. В обратном случае, факультет выводить не требуется